#include <iostream>
using namespace std;
int main() {
	//8
	//ƒаны натуральные числа от 20 до 50.
	//Ќапечатать те из них, которые дел€тс€ на 3, но не дел€тс€ на 5
	//for (int i = 20; i <= 50; i++) {
		//if (i % 3 == 0 && i % 5 != 0) {
			//cout << i << "";
		//}
	//9
	//даны натуральные числа от 35 до 87. 
	//Ќайти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	//for (int i = 35; i <= 87; i++)
		//(i % 7 == 1 || i % 7 == 2 || i % 5) {
		//cout << i << " ";
	//10
	//}
	//ƒаны натуральные числа от 1 до 50. 
	//Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	//int n = 0;
	//for (int i = 1; i <= 50; i++) {
		//if (i % 5 == 0 || i % 7 == 0) {
			//n = n + 0;
	 //}

		//cout << n << " ";

	//11
	//Ќапечатать те из двузначных чисел которые дел€тс€ на 4, но не дел€тс€ на 6.
	//for (int i = 10; i <100 ; i++) {	
		//if (i % 4 == 0 && i % 6 != 0) {
			//cout << i << " ";
		//}

	//12
	//Ќайти произведение двузначных нечетных чисел кратных 13.
	//for (int i = 10; i < 100; i++) {
		//if (i % 2 != 0 && i % 13 == 0) {
			//cout << i << " ";
		//}





	//}

	
	








































}